[
  {
    "id": "math102-p1",
    "subjectId": "math102",
    "title": "Graph Algorithm Visualizer",
    "description": "Build a comprehensive graph algorithm visualizer that demonstrates the core concepts from Discrete Mathematics II. The project should provide an interactive interface for creating graphs and visualizing how different graph algorithms execute step-by-step. This project integrates combinatorics (counting paths), graph theory, and graph algorithms into a single cohesive application that helps users understand these mathematical concepts through visual exploration.",
    "requirements": [
      "Implement a graph data structure supporting both directed and undirected graphs with weighted edges",
      "Provide an interactive UI for creating, editing, and visualizing graphs (vertices and edges)",
      "Implement and visualize Breadth-First Search (BFS) with step-by-step animation showing the queue state and visited nodes",
      "Implement and visualize Depth-First Search (DFS) with step-by-step animation showing the stack/recursion state",
      "Implement and visualize Dijkstra's shortest path algorithm with priority queue visualization",
      "Implement and visualize a minimum spanning tree algorithm (Kruskal's or Prim's)",
      "Display graph properties such as vertex degrees, total edges, and whether the graph is connected",
      "Implement path counting between two vertices using combinatorial methods",
      "Allow users to select algorithms, set speed of animation, and step through execution manually",
      "Display algorithm complexity and iteration count for educational purposes",
      "Include at least 3 pre-built example graphs demonstrating different graph types",
      "Provide clear documentation explaining the mathematical concepts and algorithms implemented"
    ],
    "rubric": [
      {
        "name": "Graph Data Structure Implementation",
        "weight": 15,
        "levels": [
          {
            "score": 100,
            "label": "Excellent",
            "description": "Graph structure efficiently handles both directed/undirected graphs, supports weighted edges, and provides clear API for graph operations. Edge cases are handled properly."
          },
          {
            "score": 75,
            "label": "Good",
            "description": "Graph structure works correctly for most cases with minor issues. Supports required features but may have inefficiencies."
          },
          {
            "score": 50,
            "label": "Satisfactory",
            "description": "Basic graph structure implemented but missing some features or has bugs in edge cases."
          },
          {
            "score": 25,
            "label": "Needs Improvement",
            "description": "Graph structure has significant bugs or missing key functionality."
          }
        ]
      },
      {
        "name": "Algorithm Implementations",
        "weight": 30,
        "levels": [
          {
            "score": 100,
            "label": "Excellent",
            "description": "All required algorithms (BFS, DFS, Dijkstra, MST) correctly implemented with proper time complexity. Code is clean, well-documented, and handles edge cases."
          },
          {
            "score": 75,
            "label": "Good",
            "description": "All algorithms implemented and mostly correct. Minor bugs or inefficiencies present. Documentation adequate."
          },
          {
            "score": 50,
            "label": "Satisfactory",
            "description": "Most algorithms implemented but some have bugs or incorrect results. Missing documentation."
          },
          {
            "score": 25,
            "label": "Needs Improvement",
            "description": "Several algorithms missing or incorrectly implemented. Poor code quality."
          }
        ]
      },
      {
        "name": "Visualization Quality",
        "weight": 25,
        "levels": [
          {
            "score": 100,
            "label": "Excellent",
            "description": "Outstanding visualizations with smooth animations, clear color coding, informative labels. Shows algorithm state (queue/stack) and data structures. Highly intuitive and educational."
          },
          {
            "score": 75,
            "label": "Good",
            "description": "Good visualizations that clearly show algorithm execution. Some aspects could be more polished or informative."
          },
          {
            "score": 50,
            "label": "Satisfactory",
            "description": "Basic visualization present but lacks polish or clarity. Difficult to follow algorithm execution."
          },
          {
            "score": 25,
            "label": "Needs Improvement",
            "description": "Minimal or unclear visualization. Does not effectively demonstrate algorithm behavior."
          }
        ]
      },
      {
        "name": "User Interface and Interaction",
        "weight": 15,
        "levels": [
          {
            "score": 100,
            "label": "Excellent",
            "description": "Intuitive, polished UI with easy graph creation/editing. Smooth controls for animation speed, stepping, and algorithm selection. Excellent user experience."
          },
          {
            "score": 75,
            "label": "Good",
            "description": "Functional UI that allows all required interactions. Some usability improvements possible."
          },
          {
            "score": 50,
            "label": "Satisfactory",
            "description": "Basic UI that works but may be unintuitive or clunky. Missing some interactive features."
          },
          {
            "score": 25,
            "label": "Needs Improvement",
            "description": "Poor UI that is difficult to use or missing key interactive features."
          }
        ]
      },
      {
        "name": "Documentation and Code Quality",
        "weight": 15,
        "levels": [
          {
            "score": 100,
            "label": "Excellent",
            "description": "Comprehensive documentation explaining mathematical concepts, algorithms, and usage. Clean, well-organized code with meaningful names and comments. Follows best practices."
          },
          {
            "score": 75,
            "label": "Good",
            "description": "Good documentation covering main concepts. Code is readable with adequate comments."
          },
          {
            "score": 50,
            "label": "Satisfactory",
            "description": "Basic documentation present. Code is somewhat disorganized or lacks comments."
          },
          {
            "score": 25,
            "label": "Needs Improvement",
            "description": "Minimal documentation. Code is poorly organized or difficult to understand."
          }
        ]
      }
    ],
    "estimatedHours": 40
  }
]